using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp3
{
    class Program  
       /// Иванов Игорь ///
    {
        static void Task2(string[] args) ///2. Ввести вес и рост человека. Рассчитать и вывести индекс массы тела (ИМТ) по формуле I=m/(h*h); где m — масса тела в килограммах, h — рост в метрах.///
        {
            /* Console.WriteLine("Рост, м: ");
               double h = Convert.ToDouble(Console.ReadLine());

               Console.WriteLine("Вес, кг: ");
               double m = Convert.ToDouble(Console.ReadLine());

               Console.WriteLine("ИМЦ = " + m / (h * h)); 


              */




        }
        static void Task4(string[] args) ///Написать программу обмена значениями двух переменных типа int без использования вспомогательных методов.///
        {
            /*  int a = 1;
              int b = 2;
              Console.WriteLine(a + " " + b);

              int t = a;
              a = b; //2
              b = t; //1
              Console.WriteLine(a + " " + b);

              b = a + b; //3
              a = b - a; //3-2=1
              b = b - a; //3-1=2
              Console.WriteLine(a + " " + b);
              */

        }
        static void Task5(string[] args) /// Написать программу, которая выводит на экран ваше имя, фамилию и город проживания.///
        {
            /* string name = "Гарик";
             string surname = "Иванов";
             string city = "Санкт-Петербург";
            */






        }






    }
   
} 